Revit 2025 API
RasterQualityType Enumeration
 An enumerated type listing the options for raster quality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RasterQualityType
Public Enumeration RasterQualityType
public enum class RasterQualityType
type RasterQualityType
Members
Member name | Value | Description
Low | 72 |  The type of Raster Quality is Low.
Medium | 150 |  The type of Raster Quality is Medium.
High | 300 |  The type of Raster Quality is High.
Presentation | 600 |  The type of Raster Quality is Presentation.
See Also
Reference
Autodesk.Revit.DB Namespace